In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd
df = pd.DataFrame(people)

In [3]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [5]:
#TO rename column name
df.columns = ["first name", "last name", "email Id"]

In [6]:
df.columns

Index(['first name', 'last name', 'email Id'], dtype='object')

In [7]:
df

  first name last name                 email Id
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
#TO convert columsn name to uppr case
df.columns = [x.upper() for x in df.columns]

In [9]:
df

  FIRST NAME LAST NAME                 EMAIL ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
#To replace column name, space with '_'
df.columns = df.columns.str.replace(" ", "_")

In [11]:
df

  FIRST_NAME LAST_NAME                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [12]:
#To rename specific column names using rename method

df.rename(columns = {"FIRST_NAME":"first_name", "LAST_NAME":"last_name"}, inplace=True)

In [13]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [14]:
#To change all column values in index position 2
df.loc[2] = ["john", "smith", "john.smith@gmail.com"]

In [15]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       john     smith     john.smith@gmail.com

In [16]:
#To change only specific column values in index position 2
df.loc[2, "EMAIL_ID"] = "Hohn.smith@gamil.com"

In [17]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       john     smith     Hohn.smith@gamil.com

In [18]:
#To change multiple specific column values in index position 2
df.loc[2, ["first_name", "EMAIL_ID"]] = ["John", "Hohn.smith@gamil.com"]

In [19]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     smith     Hohn.smith@gamil.com

In [20]:
#Another way to labels value using 'at
df.at[2, "EMAIL_ID"] = "John.smith@gamil.com"

In [21]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     smith     John.smith@gamil.com

In [22]:
#To change email id label
mask = df["EMAIL_ID"] == "John.smith@gamil.com"

In [23]:
df.loc[mask, "EMAIL_ID"] = "hohn.smith@gamil.com"

In [24]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John     smith     hohn.smith@gamil.com

In [25]:
#TO change email_id column to lowercase
df["EMAIL_ID"] = df["EMAIL_ID"].str.lower()

In [26]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  coreymschafer@gmail.com
1       Jane       Doe        janedoe@email.com
2       John     smith     hohn.smith@gamil.com

In [27]:
#apply - used for calling a fucntion with values
#map
#applymap
#replace

In [28]:
#apply function with series
#apply to find length of email id
df["EMAIL_ID"].apply(len)

0    23
1    17
2    20
Name: EMAIL_ID, dtype: int64

In [29]:
def update_email(email):
    return email.upper()

In [30]:
#apply function to change email id to upper case
df["EMAIL_ID"] = df["EMAIL_ID"].apply(update_email)

In [31]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  COREYMSCHAFER@GMAIL.COM
1       Jane       Doe        JANEDOE@EMAIL.COM
2       John     smith     HOHN.SMITH@GAMIL.COM

In [32]:
#lambda function to change email to lower case

df["EMAIL_ID"] = df["EMAIL_ID"].apply(lambda a: a.lower())

In [33]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  coreymschafer@gmail.com
1       Jane       Doe        janedoe@email.com
2       John     smith     hohn.smith@gamil.com

In [34]:
#To check number of values..for ex first_name contains three values corey,jane,john
df.apply(len)

first_name    3
last_name     3
EMAIL_ID      3
dtype: int64

In [35]:
#apply_map function with dataframe - to apply to the entire dataframe
df.applymap(len)

   first_name  last_name  EMAIL_ID
0           5          7        23
1           4          3        17
2           4          5        20

In [36]:
#applymap to convert the entire dataframe to lowercase
df.applymap(str.lower)

  first_name last_name                 EMAIL_ID
0      corey   schafer  coreymschafer@gmail.com
1       jane       doe        janedoe@email.com
2       john     smith     hohn.smith@gamil.com

In [37]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  coreymschafer@gmail.com
1       Jane       Doe        janedoe@email.com
2       John     smith     hohn.smith@gamil.com

In [40]:
#map method works only on series..used for substiuting each value in a series
#converting the first name of Corey to chris and Jane to mary and we are not changing john so it is NaN to overcome this we can 
#use replace
df["first_name"].map({"Corey":"chris", "Jane":"mary"})

0    chris
1     mary
2      NaN
Name: first_name, dtype: object

In [41]:
df

  first_name last_name                 EMAIL_ID
0      Corey   Schafer  coreymschafer@gmail.com
1       Jane       Doe        janedoe@email.com
2       John     smith     hohn.smith@gamil.com

In [43]:
#replace method
df["first_name"] = df["first_name"].replace({"Corey":"chris", "Jane":"mary"})

In [44]:
df

  first_name last_name                 EMAIL_ID
0      chris   Schafer  coreymschafer@gmail.com
1       mary       Doe        janedoe@email.com
2       John     smith     hohn.smith@gamil.com